#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bizkt/restricted-buckets/runs/run-N9NtGTNq6kMN6hze

Waiting for the plan to start...

Terraform v1.7.2
on linux_amd64
Initializing plugins and modules...
module.iam.data.aws_iam_policy_document.restricted_bucket_custom_policy: Refreshing...
module.iam.data.aws_iam_policy.view_only_access: Refreshing...
module.iam.data.aws_iam_policy_document.restricted_bucket_custom_policy: Refresh complete after 0s [id=3468000586]
module.iam.data.aws_iam_policy.view_only_access: Refresh complete after 1s [id=arn:aws:iam::aws:policy/job-function/ViewOnlyAccess]
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_REGION" but a value
│ was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-N9NtGTNq6kMN6hze/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-N9NtGTNq6kMN6hze/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.buckets.data.aws_iam_policy_document.my-buckets-access-policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "my-buckets-access-policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.buckets.aws_s3_bucket.restricted_bucket will be created
  + resource "aws_s3_bucket" "restricted_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-bucket-0222024"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.buckets.aws_s3_bucket_policy.my-buckets-access-policy will be created
  + resource "aws_s3_bucket_policy" "my-buckets-access-policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.buckets.aws_s3_bucket_public_access_block.restricted_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "restricted_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.iam.aws_iam_policy.restricted_bucket_custom_policy will be created
  + resource "aws_iam_policy" "restricted_bucket_custom_policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "my-buckets-access-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:CreateBucket",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:PrincipalAccount" = "987654321098"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:s3:::my-bucket-0222024/*",
                          + "arn:aws:s3:::my-bucket-0222024",
                        ]
                      + Sid       = "RestrictedBucketAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.iam.aws_iam_policy_attachment.restricted_bucket_policy_attachment["my-buckets-access-policy"] will be created
  + resource "aws_iam_policy_attachment" "restricted_bucket_policy_attachment" {
      + id         = (known after apply)
      + name       = "restricted-bucket-viwer-policy-attachment"
      + policy_arn = (known after apply)
      + roles      = [
          + "my-bucket-0222024",
        ]
    }

  # module.iam.aws_iam_policy_attachment.restricted_bucket_policy_attachment["view_only_access"] will be created
  + resource "aws_iam_policy_attachment" "restricted_bucket_policy_attachment" {
      + id         = (known after apply)
      + name       = "restricted-bucket-viwer-policy-attachment"
      + policy_arn = "arn:aws:iam::aws:policy/job-function/ViewOnlyAccess"
      + roles      = [
          + "my-bucket-0222024",
        ]
    }

  # module.iam.aws_iam_role.restricted_bucket_role will be created
  + resource "aws_iam_role" "restricted_bucket_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "lambda.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "my-bucket-0222024"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 0 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @krishanthisera, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*